{
  "February_1938": "No relevant events",
  "March_1938": "Germany announces the annexation of Austria to itself",
  "April_1938": "No relevant events",
  "May_1938": "No relevant events",
  "June_1938": "No relevant events",
  "July_1938": "No relevant events",
  "August_1938": "Germany, Italy, United Kingdom and France sign the Munich Agreement, which obliges Czechoslovakia to surrender to Germany the sudeti",
  "September_1938": "No relevant events",
  "October_1938": "No relevant events",
  "November_1938": "No relevant events",
  "December_1938": "No relevant events",
  "January_1939": "No relevant events",
  "February_1939": "No relevant events",
  "March_1939": "The Slovak republic (after Germany's pressures) is born, Germany violates the Munich agreement by occluding the borders of Bohemia and Moravia by creating a protectorate. France and United Kingdom declare themselves as guarantors of territorial integrity",
  "April_1939": "Italy invades and annexes Albania",
  "May_1939": "No relevant events",
  "June_1939": "No relevant events",
  "July_1939": "No relevant events",
  "August_1939": "Soviet Union and Germany sign a non-aggression pact (Molotov-Ribbentrop pact)",
  "September_1939": "Germany invades Poland, the World War II begins. Consequently United Kingdom and France declare war to Germany.",
  "October_1939": "No relevant events",
  "November_1939": "Soviet Union invades Finland, starting the so called Winter War",
  "December_1939": "Soviet Union and Finland are involved in the Winter War",
  "January_1940": "Soviet Union and Finland are involved in the Winter War",
  "February_1940": "Soviet Union and Finland are involved in the Winter War",
  "March_1940": "Finland asks the armistice, with which it gives to Soviet Union the northern part of the Lagoda lake and the coastal area along the Arctic Sea",
  "April_1940": "Germany invades Denmark and Norway. Denmark surrenders during April.",
  "May_1940": "Germany and Norway are involved in the war caused by German invasion. Meanwhile Germany attacks France, and occupies Netherlands. Luxembourg is occupied by Germany; Holland and Belgium surrender",
  "June_1940": "Norway signs an armistice with Germany and becomes an axis-occupied territory.France sign an armistice with Germany: Germany occupies the north of France, in the south the Vichy republic (as a de facto client state of Germany) is born. Italy declares war to France and United Kingdom. Soviet Union obliges Romania to surrenders to Soviet Ukraine some parts of itself territories. Soviet Union occupies also Baltic countries, which become Soviet republic.",
  "July_1940": "The Battle of England begins",
  "August_1940": "Germany and Italy force Romania to surrenders a part of Transylvania to Hungary",
  "September_1940": "Italy invades Egypt (which was under Britain control). Germany, Italy and Japan sign the Tripartite pact",
  "October_1940": "Italy invades Greece, starting from Albania",
  "November_1940": "The republic of Slovakia, Hungary and Romania adhere to Axis power",
  "December_1940": "No relevant events",
  "January_1941": "No relevant events",
  "February_1941": "No relevant events",
  "March_1941": "Bulgary joins Axis forces.",
  "April_1941": "Germany, Italy and Bulgary invade and dismember the Jugoslavia.The Indipendent State of Croatia is born, which includes Bosnia Herzegovina, immediately recognized by Italy and Germany.",
  "May_1941": "Germany and Bulgary invade Greece to help Italy.",
  "June_1941": "Greece surrenders to Germany, Bulgary and Italy. Croatia joins the Axis Forces.",
  "July_1941": "Finland joins Axis Forces. All the Axis Forces, except Bulgary, invade the Soviet Union.",
  "August_1941": "No relevant events",
  "September_1941": "Germany and Finland conquer Baltic countries and siege Leningrad.",
  "October_1941": "Germans moves to Moscow.",
  "November_1941": "No relevant events",
    "December_1941": "Soviet Union forces the Germans to retreat.",
    "January_1942": "No relevant events",
  "February_1942": "No relevant events",
  "March_1942": "No relevant events",
  "April_1942": "No relevant events",
  "May_1942": "United Kingdom starts to bombard a lot of German cities",
  "June_1942": "Axis forces try to invade Soviet Union.",
  "July_1942": "No relevant events",
  "August_1942": "No relevant events",
  "September_1942": "Germany enters in Stalingrad.",
  "October_1942": "United Kingdom forces defeat Italy and Germany in Egypt.",
  "November_1942": "Vichy try to stop the US and United Kingdom attack in Morocco. Germans occupy the Vichy republic.",
  "December_1942": "No relevant events",
  "January_1943": "No relevant events",
  "February_1943": "Soviet Union forces Nazist Forces to surrend.",
  "March_1943": "No relevant events",
  "April_1943": "No relevant events",
  "May_1943": "No relevant events",
  "June_1943": "No relevant events",
  "July_1943": "US and United Kingdom army land in Sicily. ",
  "August_1943": "Sicily becomes under Allies control. Germany attacks Soviet Union, but it is defeated. ",
  "September_1943": "New Italian government surrenders to Allies in the South Italy. In the North there is a puppet state guided by Mussolini.",
  "October_1943": "No relevant events",
  "November_1943": "Soviet Union liberates Kiev, Ukraine.",
  "December_1943": "No relevant events",
  "January_1944": "Allies land near Rome",
  "February_1944": "The Germans fear that Hungary is going to abandon the Axis: they occupy the country ",
  "March_1944": "No relevant events",
  "April_1944": "No relevant events",
  "May_1944": "No relevant events",
  "June_1944": "Allies liberate Rome. US and United Kingdom arms land in Normandy. Soviet Union reaches the centre of Poland.",
  "July_1944": "US and United Kingdom arms exceed Nazist arms and they rush towards Paris.",
  "August_1944": "Polish Resistance and Soviet Union arms try to liberate Varsavia. Allies land near Nice and move rapidly towards the North, liberating Paris. Romania is liberated by the Resistance and immediately it joins the Allies. Slovak Resistance ris e against Slovak Fascist regimes.",
  "September_1944": "Romanians, now Allies aligned, force the Bulgarian to surrender. Finland signs an armistice with Soviet Union and then leaves the Axis Forces",
  "October_1944": "Varsavia is liberated by Polish Resistance and Soviet Union forces. Romanians, now Allies aligned, force the retreat of Germany into Greece, Albany and South Jugoslavia. Germans end the Slovak Resistance.",
  "November_1944": "No relevant events",
  "December_1944": "Germans try to conquer Belgium, this battle is regarded as Battle of the Bulge",
  "January_1945": "Germans are retiring from Belgium. Soviet Union liberates Warsaw and Krakow.",
  "February_1945": "Soviet Union conquers Budapest.",
  "March_1945": "US army traverses Reno river.",
  "April_1945": "Soviet Union conquers Bratislava and successively liberates Vienna. Soviet Union surround Berlin.",
  "May_1945": "Germany surrenders to Allies Forces."
}