{ 
  "Greece": "Greece has been occupied from Italy in 1938. Until its liberation in 1944 (from the Red Army) it has been theatre of some battles on its territory",
  "Hungary":"Hungary joined the axis, in 1940.\n Until 1943 Hungary fought alongside Germany and Italy in the Russian countryside.\n In the first part of 1944 Hungary tried to join the Allies and has been invaded from Germany.\n Since the first month of 1945 it become a sort of 'Soviet Republic' ",
  "Czecho-Slovakia":"Czecho-Slovakia: during the first years of the war it lost some territories in favor of Germany and Hungary\nCzecho-Slovakia fought against the Axis power, but the its territory were not heavily involved in the war. The only exception was for the german occupuation.",
  "Netherlands":"Netherlands: in 1939 declares its neutrality, and was invaded in 1940 by Germany.\n During the war it has been an Axis-occupied territory.\n After the Normandy landings Netherland has been liberated from Allies troops.",
  "Belgium":"Belgium: in 1939 declares his neutrality, and was invaded in 1940 by Germany.\n During the war has been an Axis-occupied territory.\n After the Normandy landings Belgium has been liberated from Allies troops, and his terrotory becomes theatre of some battles.",
  "France":"France declares war to Germany in 1939 after the invasion of Poland.\n In the June of 1940 France was occupied, and its territory was splitted in two parts.\n In the north there was a nazist government, which collapsed in 1944-45 after the Normandy landings.\n An important contribution came from many resistance movements",
  "Spain":"Spain remains neutral for large part of the war.\n From june 1940 to the first months of 1943 the spanish leader, Francisco Franco, declared the Non-Belligerant status.\n In 1943 Spain retured neutral.",
  "Italy":"Italy joined war with Germany in June 1940 under the command of Mussolini.\n Italy participates to the invasion of Soviet Union(1942), Albania(1940) and Greece(1941).\n In July 1943 Mussolini was dismissed from his role, and General Badoglio took the power. In September Germany occupies the north of Italy, so the king and Badoglio took refuge in the south. Italy was freed from Allies Power and the partisans in 1945.",
  "Switzerland":"Switzerland has been neutral for all the period of the war, from 1939 to 1945.",
  "United_Kingdom":"United Kingdom declared war to Germany in 1939.\n It wins the Battle of England against Germany, and leads the allies to the final victory.",
  "Denmark":"Denmark has been invaded from Germany in 1940, and remained under german control until the liberation, in 1945. In Denmark were born a lot of partisan groups which fought against Germany. ",
  "Sweden":"Sweden has been neutral for all the duration of the war. The only thing worth mentioning are the humanitarian aid to Finland during the Winter War against Soviet Union.",
  "Norway":"Denmark has been invaded from Germany in 1940, and remained under german control until the liberation, in 1945.",
  "Turkey":"Sweden has been neutral for all the duration of the war. He join in the Allies side on February 1945 in a symbolic way.",
  "Gibraltar":"British territory, important during the war for the conflict balances",
  "Portugal":"Portugal has been neutral for all the duration of the war.",
  "Luxembourg":"Luxembourg has been invaded from Germany in 1940, and remained under german control until the liberation, in the earliest months of 1945.",
  "Ireland":"Ireland has been neutral for all the duration of the war.",
  "Iceland":"Iceland has been invaded from United Kingdom in 1940, but in fact it behaved as a neutral state",
  "Malta":"Malta joined into war in the June of 1940 with the Allies and exited in November 1942. It's provision to the war has been predominantly about diplomacy",
  "Cyprus":"Cyprus has been neutral for all the duration of the war. Some Cypriot volunteers fought under British command ",
  "Latvia":"Latvia has been neutral up to 1941, when it has been occupied by Soviet Union. During the invasion of Soviet Union Latvia has been occpupied by Germany. In 1944 Latvia has been liberated from the Red Army.",
  "Estonia":"Estonia has been neutral up to 1941, when it has been occupied by Soviet Union. During the invasion of Soviet Union Estonia has been occpupied by Germany. In 1944 Estonia has been liberated from the Red Army.",
  "Andorra":"Andorra remained neutral and was an important smuggling route from Spain into France.",
  "Monaco":"Monaco has been invaded by Italy in 1942. After, in 1943 the command passed to Germany. Finally, in September 1944 Monaco has been liberated.",
  "San_Marino":"San Marino has been neutral for all the duration of the war.",
  "Vatican":"Vatican City has been neutral for all the duration of the war.",
  "Liechtenstein":"Liechtenstein has been occupied from the Axis Power in 1941",
  "Albania":"Albania has been occupied from Italy in 1938. Until his liberation in 1944 (from the Red Army) it has been theatre of some battles on its territory",
  "Lithuania":"Lithuania has been neutral up to 1941, when it has been occupied by Soviet Union. During the invasion of Soviet Union Lithuania has been occupied by Germany. In 1944 Lithuania has been liberated from the Red Army.",
  "Finland":"Finland divides his War in two parts: in the first part (1940-41) it fought against Soviet Union in the defense of his territory during the Winter War; in the second part (1941-1944) fought against the Allies in help of the Axis Power.",
  "Danzig":"Danzig was a Free city, created during the pacts after the WWI.\n After the polish invasion by Germany it was annexed to Germany.",
  "Poland":"Poland has been invaded from Germany in 1939, the first act of WWII. During the War has been transformed in a General Government by Germany. It has been liberated in 1945 from the Red Army.",
  "Yugoslavia":"Yugoslavia is invaded from the Axis Power in 1940, has been splitted in many countris in 1941.",
  "Romania":"Romania remains neutral up to the end of 1940, when was occupied by the Axis Power. Romania has been liberated from the Red Army in the end of 1944, during the Soviet Union advanced to Berlin",
  "Germany":"Germany, under the command of Adolf Hitler invades Poland in 1939, and began the WWII.\n From 1939 to 1942 the power of Germany was unrestrainable.\n The only defeat was in 1941 during the England Battle; in the same year Germany starts the Operation Barbarossa to invade Soviet Union.\n Since 1942 the war change drastically: Germany lost in Egypt(1942) and Soviet Union stars his counteroffensive.\n In 1945 the Red Army liberated the lager of Auschitz, and in April entered into Berlin.",
  "Soviet_Union":"Soviet Union has been neutral since 1941, when has been attacked by Germany.\n During the invasion the Wermarcht arrived near Moscow, but in 1943 the Red Army, under the command of Josif Stalin, rejected the german Army and arrived in Berlin in 1945.\n Soviet Union has suffered the highest number of deaths durng the war.",
  "Slovakia":"Slovakia is occupied by axis, it created according to Hitler's will.",
  "Carpatho-Ukraine":"Carpatho-Ukraine has been a region of the Czecho-Slovakia, occupied by Hungary in 1939. This region has been liberated in 1944 from the Red Army. ",
  "Protectorate_of_Bohemia_and_Moravia":"Protectorate of Bohemia and Moravia has been created from Germany in 1939, and resists up to 1945, when he Axis Power were defeated.",
  "Transnistria":"Transnistria is a territory which exist between 1941 and 1944, under the control of Romania.",
  "General_Government":"General Government: Poland has been invaded from Germany in 1939, the first act of WWII. During the War has been transformed in a General Government by Germany. It has been liberated in 1945 from the Red Army. ",
  "Reichskommissariat_Ostland":"Reichskommissariat Ostland is created in 1941 during the German invasion of Soviet Union(in the regions of Latvia, Lithuania and Estonia). It ends in 1945 during the Red Army advance",
  "Reichskommissariat_Ukraine":"Reichskommissariat Ukraine is created in 1941 during the German invasion of Soviet Union(in the region of Ukraine). It ends in 1945 during the Red Army advance",
  "Italian_Social_Republic":"Italian Social Republic is created in 1943 in the north of Italy from Germany, the leader was Mussolini. This state ended in 1945 as well as his leader. ",
  "Bulgaria":"Bulgaria remains neutral up to the end of 1940, when was occupied by the Axis Power. Bulgaria has been liberated from the Red Army in the end of 1944, while the Soviet Union advanced to Berlin",
  "Croatia":"Croatia has been created in 1941 during the German invasion of Soviet Union(in the region of Yugoslavia). It ends in 1945 during the Red Army advance",
  "Montenegro":"Montenegro has been created in 1941 during the German invasion of Soviet Union(in the region of Yugoslavia). It ends in 1945 during the Red Army advance",
  "Serbian_Residual_State":"Serbia has been created in 1941 during the German invasion of Soviet Union(in the region of Yugoslavia). It ends in 1945 during the Red Army advance",
  "Vichy_France": "The Vichy republic has been created in 1940 from Germany. It was situated in the south of France, and operated as collaborative government with Germany. During 1944 when Allies landed to Normandy France has been reunited."
}

